Язык UML это средство визуальзации моделей программных систем.
Формальные детализированная форма диаграмма - это модель.
Не формальные - эскиз.
UML - состоит из списков форм
Принцеп подовление или сокрытие - является одним из основных из UML

Типы диаграмм:

Диаграммы структуры:
Диаграммы классов:
Диаграммы объектов:
Диаграммы компонетов:
Диаграммы размещение:
Диаграммы состоаных структур:
Диаграммы профелей:
Диаграммы поведения:
Диаграммы процедентов:
Диаграммы деятельности:
Диаграммы состояннй:
Диаграммы взаимодействия:
Диаграммы коммуникации:
Диаграммы последовательности:
Диаграммы обзора взаймодействий:
Временные диаграммны

Вовросы:
1. Для чего нужен язык UML? -
Нужен для того, чтобы создавать наглядные схемы (то есть диаграммы) сложных программных систем и бизнес-процессов. 
Это не язык программирования, на нем не пишут код.
Проще говоря он позволяет показывать точную судь, которую хочет передать разработчик.

2. Из чего состоит UML? -
Сущности, Отношения, Диаграммы.
* Сущности которых строится модель: классы, интерфейсы, компоненты, узлы (железо).
* Отношение оказывают, как сущности взаимодействуют друг с другом
* Диаграммы по сути готовые картины, собранные из сущностей и связей

3. Что такое диаграмма UML? -
Это чертеж или схема, на которой с помощью специальных символов (блоков, стрелок и линий).
С помощью которой изображена структура или поведение программы.

4. На какие два основных типа делятся диаграммы UML? -
Делятся на Структурные и Поведенческие.
Структурные - Описывают каркас системы
Поведенческие - Описывают как она работает во времени.

5. Сколько элементов должно быть на диаграмме? Зачем в UML -
Лучше брать столько, сколько нужно, чтобы человек смог запомнить это.

6. Что такое прямое и обратное проектирование? -
Прямое проектирование - Процесс превращения диаграмм в код.
Нюанс: Автоматика создает только скелет, алгоритмы всё равно пишет программист.

Обратное проектирование - Процесс превращения готового кода в диаграммы.
Нюанс: Часто получается — если код запутан, схема будет выглядеть как хаос из тысяч линий, и её придется долго приводить в порядок вручную.

Класс можно представить как описание общих атрибутов и некой совокупности объектов

Структура и поведение
Структура класса также включает в себя общие фукции
В объекты входят классы, интерфейсы и т.д.

Примитивные типы данных:
-integer
-string
-real
-boolean
-unlimitednatural

атрибуд * - описание свойства клвасса в текстовом форме
Полная спицификация атрибута:
мд имя: тип кратности = знач_по_умолч
мд модификатор доступа к атрибуту
- доступен только внутри класса
+ доступен всем
# доступен внутри потомков класса

Кратность узкаывает сколько экземпляров данных указанного типа хранится в атрибуте:
* [2]
* [0..2]
* [*]
UML не отвечает за то, как элементы представлены в программе
Ограничения - перечисленные через запятую в свойства и ограчения, наложенные на данный атрибут:
* {readOnly}
* {>0}
* {notNull, unique}


мд имя (параметры): тип возвр_знач

Ассоциация
Представляет собой совокупность связей экземпляров данного класса с объектами другого класса
Стрелка на ассоциации показывет направление видимости.
Пример: у экземпляра класса Студента есть указатель на один или несколько объектов класса учебная часть

Примеры умолчаний:
Если указана кратность роли или N - это означает ровно 1..1 N..N
Если кратность равна *, это означает 0..*
Имя роли класса совпадает с именем самого класса

Вопросы.
1. что такое класс в UML? Для чего предназначены диаграммы классов? для чего они не предозначены?
Описание совокупности объектов, которые имеют общие характеристики: атрибуты, операции, отношения с другими объектами и семантику
Не предозначены - диаграммы классов плохо подходят для описания динамики.
Они показывают структуру, но абсолютно игнорируют время и процессы.

2. Как изображаются классы изображаются классы в UML? (показать и описать)
Если просто, не хочу заходить сейчас в Draw.io, нарисую спомощью символов.
+---------------------------+
|          User             |  <-- Имя
+---------------------------+
| - id: int                 |  <-- Атрибуты
| - name: String            |
+---------------------------+
| + getName(): String       |  <-- Операции
| + setName(n: String)      |
+---------------------------+
3. Что такое атрибут класса? как отображается в диаграмме классов?
Атрибут класса — это свойство или характеристика, которой обладают все объекты данного класса. 
(например, «цвет» у класса «Машина» или «цена» у класса «Товар»).
* видимость имя : тип = значение_по_умолчанию

+--------------------------+
|        Smartphone        |
+--------------------------+
| - model: String          | <-- Приватная строка
| - batteryLevel: int = 100| <-- Приватное число с начальным значением
| + isOn: boolean = false  | <-- Публичный флаг (вкл/выкл)
+--------------------------+
|  (здесь операция,        |
|      лень писать всё)    |    
+--------------------------+
4. Что такое операция класса? как отображается в диаграмме классов?
Это описание услуги или поведения, которое может выполнить объект этого класса.
(параметр1 : тип, параметр2 : тип) : тип_возвращаемого_значения

+------------------------------+
|          Calculator          |
+------------------------------+
| (здесь были бы атрибуты,     |
| но тоже лень писать всё.     |
|                              |
+------------------------------+
| + add(a: int, b: int): int   | <-- Складывает два числа и возвращает сумму
| + clear(): void              | <-- Очищает память (ничего не возвращает)
| - selfTest(): boolean        | <-- Внутренняя проверка (приватная)
+------------------------------+

5. Перечислить основные примитивные типы данных UML. Можно ли на диаграммах UML использовать сложные типы данных?
Примитивные типы данных:
-integer
-string
-real
-boolean
-unlimitednatural

Да, можно использовать.

6. Что такое ассоциация? Как она обозначается на диаграмме классов.
Ассоциация — это смысловая связь между классами, которая показывает, что объекты этих классов знают друг о друге и могут взаимодействоватью.
Обозначаются прямой между прямоугольником
